// Tyuiu.NosovaVD.Sprint0.Task7.V4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "../Tyuiu.NosovaVD.Sprint0.Task7.V4.Lib/Tyuiu.NosovaVD.Sprint0.Task7.V4.Lib.cpp"
using namespace std;

int main()
{
    setlocale(LC_ALL, "RUS");
    int a, b;
    ISprint0Task7* service7 = new Service();
    cout << "Nosova Valeria Dmitrievna\n";
    cout << "Task7.V4\n";
    cout << "Введите 6-значное число: ";
    cin >> a;
    cout << "\nВведите цифру, которую необходимо найти в числе: ";
    cin >> b;
    bool p = service7->Rezalt(a, b);
    cout << "\nСодержится ли в 6-значном числе " << a << " цифра " << b << ": " << boolalpha << p << endl;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
